app/Http/Controllers/TournamentsController.php

    public function finish()
    {
        Tournament::query()
            ->where('is_active', '=', true)
            ->update([
                'is_active' => false,
                'ended_at' => Carbon::now()
            ]);
---
update `tournaments` set `is_active` = 0, `ended_at` = '2021-12-11 15:02:53', `tournaments`.`updated_at` = '2021-12-11 15:02:53' where `is_active` = 1