app/Http/Controllers/TournamentsController.php

    public function index()
    {
        $timeStartedAt = null;

        $hasActiveTournaments = Tournament::query()
            ->where('is_active', '=', true)
            ->exists();

        $activeStartedTournament = Tournament::query()
            ->firstWhere([
                [ 'is_active', '=', true ],
                [ 'time_started_at', '!=', null ]
            ]);

        if ($activeStartedTournament) {
            $timeStartedAt = $activeStartedTournament->time_started_at;
        }

        $tournaments = Tournament::query()
            ->orderBy('is_active', 'DESC')
            ->simplePaginate(10);
---
select exists(select * from `tournaments` where `is_active` = 1) as `exists`
select * from `tournaments` where (`is_active` = 1 and `time_started_at` is not null) limit 1
select * from `tournaments` order by `is_active` desc limit 11 offset 0

    public function create()
    {
        return view('app.tournament.create', [
            'clubs' => Club::all(['id', 'name']),
            'players' => User::with('detail')->get(['id', 'name'])->except(1)
        ]);
---
select `id`, `name` from `clubs`
select * from `user_details` where `user_details`.`user_id` in (1, 2, 3, 4, 5, 6, 7)
select `id`, `name` from `users`

    public function edit(Tournament $tournament)
    {
        return view('app.tournament.edit', [
            'tournament' => Tournament::with('details')->find($tournament->id),
            'clubs' => Club::all(['id', 'name']),
            'players' => User::with('detail')->get(['id', 'name'])->except(1)
        ]);
---
select * from `tournaments` where `tournaments`.`id` = 8 limit 1

    public function restartTimeToActiveTournaments()
    {
        Tournament::query()
            ->where('is_active', '=', true)
            ->update([
                'time_started_at' => NULL
            ]);
---
update `tournaments` set `time_started_at` = '15:01:38', `tournaments`.`updated_at` = '2021-12-11 15:01:38' where (`is_active` = 1 and `time_started_at` is null)