app/Models/User.php

select * from `club_users` where `club_users`.`user_id` = 2 and `club_users`.`user_id` is not null limit 1
select * from `clubs` where `clubs`.`id` = 1 limit 1
---
    public function club()
    {
        return Club::query()->find($this->clubUsers?->club_id);